START_MESSAGE = """
<b>سلام سید به بخش سلف خوش آمدی👋
🔹 از دستور های زیر برای مدیریت بخش سلف استفاده کنید:
</b>
1️⃣ اضافه کردن لینک دونی:
<code>/w new channel [channel_username]</code>
2️⃣ حذف لینک دونی:
<code>/w delete channel [channel_username]</code>

3️⃣ اضافه کردن گروه جدید:
<code>/w new group [group_link]</code>

4️⃣ حذف گروه:
<code>/w delete group [group_link]</code>

5️⃣ ارسال پیام همه گانی:
<code>/w alert [message]</code>

6️⃣ جوین خودکار:
/w auto join

————————————————————
💻 نوشته شده توسط: @wwaramii
"""
JOIN_FAIL_MESSAGE = "❌ عضویت در چنل با مشکل مواجه شد! لطفا لاگ ربات را ببینید."
JOIN_SUCCESS_MESSAGE = "✅ با موفقیت عضو شدیم و به دیتابیس اضافه شد."
LEAVE_FAIL_MESSAGE = "❌ ترک کانال با مشکل مواجه شد! لطفا لاگ ربات را ببینید."
LEAVE_SUCCESS_MESSAGE = "✅ کانال با موفقیت ترک شد و از دیتابیس پاک شد."
SENT_ALERTS = "🔹 تعداد {count} ارسال شد."
